app/views/shared/_like.html.haml

- if user_signed_in?
  - unless content.like_user(current_user.id).blank?
---
SELECT  `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`content_id` = 3 LIMIT 1