app/controllers/contents_controller.rb

  def index
    @contents = Content.all.includes(:user).order("id DESC").page(params[:page]).per(6)
    @ranking_contents = Content.order("likes_count DESC")
---
SELECT `contents`.* FROM `contents` ORDER BY id DESC
SELECT `contents`.* FROM `contents` ORDER BY likes_count DESC

  def create
    @contents = Content.create(params_content)
---
INSERT INTO `contents` (`name`, `text`, `image`, `created_at`, `updated_at`) VALUES ('ふ', 'ふ', '#<ActionDispatch::Http::UploadedFile:0x007fd3ac46aaa0>', '2019-03-01 06:27:58', '2019-03-01 06:27:58')

  def update
    @contents.update(params_content)
---
UPDATE `contents` SET `image` = 'oteage.png', `updated_at` = '2019-03-01 11:13:59' WHERE `contents`.`id` = 8

  def destroy
    @contents.destroy
---
DELETE FROM `contents` WHERE `contents`.`id` = 4

  def search
    if params[:params_name]
      @contents = Content.where('name LIKE(?)', "%#{params[:search]}%").page(params[:page]).per(6)
    else
      @search_tag = ActsAsTaggableOn::Tag.find_by(name: params[:search]).id
      @search_content = ActsAsTaggableOn::Tagging.where(tag_id: @search_tag).pluck(:taggable_id)
      @contents = Content.where(id: @search_content).page(params[:page]).per(6)
---
SELECT COUNT(*) FROM `contents` WHERE (name LIKE('%テ%'))
SELECT `contents`.* FROM `contents` WHERE (name LIKE('%テ%'))
SELECT `taggings`.* FROM `taggings` WHERE `taggings`.`taggable_id` = 9

  def find_contents
    @contents = Content.find(params[:id])
---
SELECT  `contents`.* FROM `contents` WHERE `contents`.`id` = 8 LIMIT 1