app/controllers/likes_controller.rb

  def show
    @user_likes =Like.where(user_id: current_user.id)
    @likes = @user_likes.pluck(:content_id)
    @like_contents =Content.where(id: @likes)
---
SELECT `likes`.`id` FROM `likes` WHERE `likes`.`user_id` = 1
SELECT `likes`.`content_id` FROM `likes` WHERE `likes`.`user_id` = 1
SELECT `contents`.* FROM `contents` WHERE `contents`.`id` IN (SELECT `likes`.`id` FROM `likes` WHERE `likes`.`user_id` IS NULL)

  def create
    @like = Like.new(user_id: current_user.id, content_id: params[:content_id])
    @like.save!
    @likes = Like.where(content_id: params[:content_id])
---
INSERT INTO `likes` (`user_id`, `content_id`, `created_at`, `updated_at`) VALUES (1, 2, '2019-03-05 14:29:33', '2019-03-05 14:29:33')
SELECT  `likes`.* FROM `likes` WHERE `likes`.`content_id` = 1 LIMIT 1

  def destroy
    like = Like.find_by(user_id: current_user.id, content_id: params[:content_id])
    like.destroy
    @likes = Like.where(content_id: params[:content_id])
---
SELECT  `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`content_id` = 3 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
SELECT  `likes`.* FROM `likes` WHERE `likes`.`content_id` = 5 LIMIT 1

  def set_content
    @content = Content.find(params[:content_id])
---
SELECT  `contents`.* FROM `contents` WHERE `contents`.`id` = 3 LIMIT 1