app/controllers/users_controller.rb

  def show

  if params[:params_content]
    @find_user = Content.find(params[:id]).user_id
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `contents`.* FROM `contents` WHERE `contents`.`user_id` = 1 ORDER BY id DESC, likes_count DESC